taskt/Core/Automation/Commands/FileGroup/AFileFilePathCommands_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.AFileFilePathCommands" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.AFileExistsFilePathCommands" [ label="AFileExistsFilePathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AFileFilePathCommands" [ label="AFileFilePathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.ExtractionFilePathCommand" [ label="ExtractionFilePathCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands" [ label="AFileExistsFilePathBeforeAfterResultCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands" [ label="AFileExistsFilePathPathResultCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AFileCopyMoveFileCommands" [ label="AFileCopyMoveFileCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands" [ label="AFileCopySameRenameFileCommands", style="dashed", ];
"taskt.Core.Automation.Commands.OpenFileCommand" [ label="OpenFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetFileInformationCommand" [ label="GetFileInformationCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CheckFileExistsCommand" [ label="CheckFileExistsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.DeleteFileCommand" [ label="DeleteFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.WaitForFileToExistCommand" [ label="WaitForFileToExistCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CopyFileCommand" [ label="CopyFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.MoveFileCommand" [ label="MoveFileCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CopyFileToSameFolderCommand" [ label="CopyFileToSameFolderCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.RenameFileCommand" [ label="RenameFileCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.AFileExistsFilePathCommands" -> "taskt.Core.Automation.Commands.AFileFilePathCommands";
"taskt.Core.Automation.Commands.ExtractionFilePathCommand" -> "taskt.Core.Automation.Commands.AFileFilePathCommands";
"taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands" -> "taskt.Core.Automation.Commands.AFileExistsFilePathCommands";
"taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands" -> "taskt.Core.Automation.Commands.AFileExistsFilePathCommands";
"taskt.Core.Automation.Commands.AFileCopyMoveFileCommands" -> "taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands";
"taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands" -> "taskt.Core.Automation.Commands.AFileExistsFilePathBeforeAfterResultCommands";
"taskt.Core.Automation.Commands.OpenFileCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.GetFileInformationCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.CheckFileExistsCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.DeleteFileCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.WaitForFileToExistCommand" -> "taskt.Core.Automation.Commands.AFileExistsFilePathPathResultCommands";
"taskt.Core.Automation.Commands.CopyFileCommand" -> "taskt.Core.Automation.Commands.AFileCopyMoveFileCommands";
"taskt.Core.Automation.Commands.MoveFileCommand" -> "taskt.Core.Automation.Commands.AFileCopyMoveFileCommands";
"taskt.Core.Automation.Commands.CopyFileToSameFolderCommand" -> "taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands";
"taskt.Core.Automation.Commands.RenameFileCommand" -> "taskt.Core.Automation.Commands.AFileCopySameRenameFileCommands";
}
